package dz16;

public class Task1 {
    public static void main(String[] args) {
        //Создать класс Кредит со следующими свойствами
        //Id
        //Сумма
        //Период
        //процентная ставка
        //
        //Выдать 5 кредитов.
        //Посчитать
        //количество выданных кредитов,
        //общую сумму выданных кредитов,
        //среднюю сумму кредитов
        //Бонус: Возможно ли подсчитать средневзвешенную ставку* по выданным кредитам?
        // Если возможно, то почему? Если нет, то почему?
        //* Найти в интернете формулу.


    }
}
