package Lesson12;

public class Task4 {
    public static void main(String[] args) {
        //Создайте класс прямоугольника.
        //Создайте свойства, объявите геттеры и сеттеры для этих свойств
        //Создайте конструктор для вашего класса
        //Создайте экземпляры класса
        //Заполните экземпляры данными
        //Выведите данные в консоль

//        Rectangle rect1 = new Rectangle(2, 6, "Красный");
//        Rectangle rect2 = new Rectangle(3, 8, "Синий");

//        System.out.println("Прямоугольник 1:");
//        System.out.println("Ширина: " + rect1.getWidth());
//        System.out.println("Высота: " + rect1.getHeight());
//        System.out.println("Цвет: " + rect1.getColor());
//
//        System.out.println();
//
//        System.out.println("Прямоугольник 2:");
//        System.out.println("Ширина: " + rect2.getWidth());
//        System.out.println("Высота: " + rect2.getHeight());
//        System.out.println("Цвет: " + rect2.getColor());
//    }
//}
    }}